import { Text, StyleSheet, View, ScrollView } from "react-native";
import { FONT, COLORS } from "../../constants/theme";
export default function About() {
  return (
    <ScrollView>
      <View style={styles.container}>
        <Text style={styles.title}>ทูดูแอป</Text>
        <Text style={styles.text}>
          แฟกซ์เลดี้สึนามิเยอบีราแจ๊กพอต ออร์เดอร์มิวสิคโหลน ซีเนียร์
          ตรวจสอบโรลออนไรเฟิล ลีเมอร์ซูฮกแพลน เป่ายิ้งฉุบ ไฮแจ็คแซนด์วิช
          ฟลอร์แพนดาทิปสะบึมส์ง่าว เรตติ้งไวอะกร้า อุด้งโง่เขลาอีสเตอร์
          สตาร์ทวืดชินบัญชรบูม ออเดอร์ กรีนอพาร์ตเมนท์ชัตเตอร์ฮาราคีรีเบลอ
          ร็อคแตงโม อินเตอร์เอสเปรสโซคาร์โก้ อุรังคธาตุ สเปกรายชื่อโปรดักชั่น
          แฮปปี้กระดี๊กระด๊า ซาร์คันยิดาวน์ ภควัทคีตาเซ็กซ์ เอสเพรสโซราเม็งซาตาน
          ไชน่าแอโรบิคเดอะ โทร ตนเองคาราโอเกะวืดแมชชีน
          ไคลแม็กซ์ปัจฉิมนิเทศโอเลี้ยง วีน สปอร์ต เซาท์กรอบรูปไฮแจ็คซัพพลาย
          พ่อค้าคอรัปชั่นฮองเฮาแคมเปญ โปรโมทผลักดันธัมโมบึ้ม ปัจเจกชนพูล
          จูเนียร์คอมเพล็กซ์ เปียโนม้านั่งแจ๊กเก็ตสกรัม
        </Text>
        <Text style={styles.text}>
          พาสปอร์ตบราต่อยอดมัฟฟินสุริยยาตร์ วานิลลาบอกซ์ซื่อบื้อ
          อพาร์ตเมนท์ช็อคผิดพลาดแชมเปญวอเตอร์ ลีกเมจิกคอร์ปมวลชน สเปก
          โบว์ลิ่งถ่ายทำพ่อค้าปาสคาลซาฟารี อิสรชนพันธุวิศวกรรมปาสเตอร์
          เปโซพริตตี้เบบี้ เซ็กซี่คาสิโนเบลอ แครอทตะหงิด
          แทงโก้ออโต้คาราโอเกะฮิปฮอป รีโมทเซอร์วิส ซาตานวานิลาเมจิค
          ซังเตซาดิสต์ช็อต อัลบัมคอนแทคเทปวันเวย์ เซอร์วิสเรตพาร์เด้อเซลส์
          เที่ยงวัน ฮ่องเต้พะเรอสเตย์กฤษณ์ ริคเตอร์สุริยยาตรเอาต์ลิสต์บึ้ม
          เฝอศิลปวัฒนธรรมสหัชญาณ แจ๊กเก็ตไนท์เด้อบ๊อกซ์ สันทนาการรีไซเคิล
          ทีวีโต๋เต๋ล้มเหลวบาลานซ์พาสตา ปัจฉิมนิเทศมิลค์ ฟรังก์ แชมปิยอง
          เมจิคมินต์วาริชศาสตร์ไพลินพาร์ทเนอร์ หมวยแพตเทิร์นฟินิกซ์
          ติวซิ้มฉลุยเดชานุภาพทับซ้อน เทคโนแครตไงบ๊อบวีเจ โหงวเฮ้ง
          อิเลียดทีวีออสซี่ โปร เคลื่อนย้ายบอร์ดออร์แกนิก พีเรียด แมนชั่น
          ล้มเหลวไพลินแบดโฟม ไมค์ดีกรีแบนเนอร์ไดเอ็ต
          โคโยตี้มินท์คอมพ์แบ็กโฮเทอร์โบ ไฟต์โอวัลตินกรอบรูปแอ๊บแบ๊วแคร็กเกอร์
          แตงโม กรีนบาร์บีคิวเอ็นเตอร์เทน ปาสกาลสไตรค์สะบึมส์
          เลสเบี้ยนออเดอร์บู๊มาร์เก็ตติ้งบ๊อกซ์ หลวงปู่เคลม มินต์เพนกวิน กลาส
        </Text>
      </View>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    flex: 1,
    padding: 20,
    gap: 20,
  },
  text: {
    fontFamily: FONT.regular,
    color: COLORS.gray,
  },
  title: {
    fontFamily: FONT.bold,
    fontSize: 20,
    color: COLORS.primary,
  },
});
